RIET/src/Catalogs/Contracts/Contracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contracts</name>
  <attributes>
    <name>Seller</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Incoterms</name>
    <type>
      <types>CatalogRef.Incoterms</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GOLD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/Contracts/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") = Истина Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзInvoice" Тогда
			// RGS { ASeryakov 26.06.2018 15:00:00 PM S-I-0004945
			Если Параметры.СтруктураНастройки.Голд Тогда
			// RGS } ASeryakov 26.06.2018 15:00:00 PM S-I-0004945
			
			НастроитьДляВыбораИзInvoice(СтруктураНастройки);
			// RGS { ASeryakov 26.06.2018 15:00:00 PM S-I-0004945
			КонецЕсли;
			// RGS } ASeryakov 26.06.2018 15:00:00 PM S-I-0004945
		КонецЕсли;
		
	КонецЕсли;
	
	Отбор = Параметры.Отбор;
	Если НЕ Отбор.Свойство("ПометкаУдаления") Тогда
		Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
	// RGS ASeryakov 26.06.2018 15:00:00 PM S-I-0004945
	Если Параметры.СтруктураНастройки.Свойство("Голд") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "GOLD", Параметры.СтруктураНастройки.Голд, ВидСравненияКомпоновкиДанных.Равно, "Отбор по GOLD", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, Новый УникальныйИдентификатор);
		
	КонецЕсли;
	// RGS ASeryakov 26.06.2018 15:00:00 PM S-I-0004945

КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзInvoice(СтруктураНастройки)
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("Seller", СтруктураНастройки.Seller);
	
	Отбор.Вставить("ConsignTo", СтруктураНастройки.ConsignTo);
	
	Отбор.Вставить("Incoterms", СтруктураНастройки.Incoterms);
	
	// Дата контракта должна быть меньше или равна дате инвойса
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.Отбор,
		"Date",
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		СтруктураНастройки.Дата);
		
	// Дата окончания контракта должна быть больше или равна дате инвойса
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.Отбор,
		"ExpiryDate",
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		СтруктураНастройки.Дата);
		
КонецПроцедуры
